# Project Title
### Data Engineering Capstone Project

#### Project Summary
This project aims to load extract transform and load various files from workspace and load them to Postrgres database. Extracted data from i94 innigration data, airport data, temperature data and demographics files from the workspace, apply transformations (remove NaN, NUL characters and duplicates, enrich data by joining with other datasets) and load them to postgres database for analytical purposes. 

The project follows the follow steps:
* Step 1: Scope the Project and Gather Data
* Step 2: Explore and Assess the Data
* Step 3: Define the Data Model
* Step 4: Run ETL to Model the Data
* Step 5: Complete Project Write Up

In [1]:
# Do all imports and installs here
import pandas as pd
import psycopg2
import re  #For data manipulation purposes
import datetime as dt #For performing date functions

from sql_queries import airport_insert, demographic_insert, immigration_insert, temperature_insert, dates_insert, ports_insert

**Step 1: Scope the Project and Gather Data**

**Scope**

This projects aims to enrich the US I94 immigration data with further data such as demographics and temperature data to have a wider basis for analysis on the immigration data. After data load, we can use the data to run analytical queries to understand immigration trends and understand data patterns .

**I94 Immigration Data**

This data comes from the US National Tourism and Trade Office. A data dictionary is included in the workspace. This is where the data comes from. There's a sample file so you can take a look at the data in csv format before reading it all in. You do not have to use the entire dataset, just use what you need to accomplish the goal you set at the beginning of the project.

In [3]:
# Read in the data here
i94_path = '../../data/18-83510-I94-Data-2016/i94_apr16_sub.sas7bdat'
df_i94 = pd.read_sas(i94_path, 'sas7bdat', encoding="ISO-8859-1")

In [4]:
pd.options.display.max_columns = None
df_i94.head(5)

,cicid,i94yr,i94mon,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,i94bir,i94visa,count,dtadfile,visapost,occup,entdepa,entdepd,entdepu,matflag,biryear,dtaddto,gender,insnum,airline,admnum,fltno,visatype
0,6.0,2016.0,4.0,692.0,692.0,XXX,20573.0,NaN,NaN,NaN,37.0,2.0,1.0,NaN,NaN,NaN,T,NaN,U,NaN,1979.0,10282016,NaN,NaN,NaN,1.897628e+09,NaN,B2
1,7.0,2016.0,4.0,254.0,276.0,ATL,20551.0,1.0,AL,NaN,25.0,3.0,1.0,20130811,SEO,NaN,G,NaN,Y,NaN,1991.0,D/S,M,NaN,NaN,3.736796e+09,00296,F1
2,15.0,2016.0,4.0,101.0,101.0,WAS,20545.0,1.0,MI,20691.0,55.0,2.0,1.0,20160401,NaN,NaN,T,O,NaN,M,1961.0,09302016,M,NaN,OS,6.666432e+08,93,B2
3,16.0,2016.0,4.0,101.0,101.0,NYC,20545.0,1.0,MA,20567.0,28.0,2.0,1.0,20160401,NaN,NaN,O,O,NaN,M,1988.0,09302016,NaN,NaN,AA,9.246846e+10,00199,B2
4,17.0,2016.0,4.0,101.0,101.0,NYC,20545.0,1.0,MA,20567.0,4.0,2.0,1.0,20160401,NaN,NaN,O,O,NaN,M,2012.0,09302016,NaN,NaN,AA,9.246846e+10,00199,B2

## World Temperature Data

This dataset came from Kaggle. You can read more about it here.

In [5]:
fname = '../../data2/GlobalLandTemperaturesByCity.csv'
df_temp = pd.read_csv(fname)

In [6]:
df_temp.head(5)

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1743-11-01,6.068,1.737,Århus,Denmark,57.05N,10.33E
1,1743-12-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
2,1744-01-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
3,1744-02-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
4,1744-03-01,NaN,NaN,Århus,Denmark,57.05N,10.33E

In [7]:
#df_temp data frame has data for all countires and will be filtering out united states data.
df_temp_us = df_temp[df_temp["Country"] == "United States"]
df_temp_us.head(5)

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
47555,1820-01-01,2.101,3.217,Abilene,United States,32.95N,100.53W
47556,1820-02-01,6.926,2.853,Abilene,United States,32.95N,100.53W
47557,1820-03-01,10.767,2.395,Abilene,United States,32.95N,100.53W
47558,1820-04-01,17.989,2.202,Abilene,United States,32.95N,100.53W
47559,1820-05-01,21.809,2.036,Abilene,United States,32.95N,100.53W

## U.S. City Demographic Data
This data comes from OpenSoft. You can read more about it here.

In [8]:
df_demographics = pd.read_csv("./us-cities-demographics.csv", delimiter=";")

In [9]:
df_demographics.head(5)

,City,State,Median Age,Male Population,Female Population,Total Population,Number of Veterans,Foreign-born,Average Household Size,State Code,Race,Count
0,Silver Spring,Maryland,33.8,40601.0,41862.0,82463,1562.0,30908.0,2.60,MD,Hispanic or Latino,25924
1,Quincy,Massachusetts,41.0,44129.0,49500.0,93629,4147.0,32935.0,2.39,MA,White,58723
2,Hoover,Alabama,38.5,38040.0,46799.0,84839,4819.0,8229.0,2.58,AL,Asian,4759
3,Rancho Cucamonga,California,34.5,88127.0,87105.0,175232,5821.0,33878.0,3.18,CA,Black or African-American,24437
4,Newark,New Jersey,34.6,138040.0,143873.0,281913,5829.0,86253.0,2.73,NJ,White,76402

## Airport Code Table
This is a simple table of airport codes and corresponding cities. It comes from here.

In [10]:
df_airport_codes = pd.read_csv("./airport-codes_csv.csv")
df_airport_codes.head(5)

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
0,00A,heliport,Total Rf Heliport,11.0,NaN,US,US-PA,Bensalem,00A,NaN,00A,"-74.93360137939453, 40.07080078125"
1,00AA,small_airport,Aero B Ranch Airport,3435.0,NaN,US,US-KS,Leoti,00AA,NaN,00AA,"-101.473911, 38.704022"
2,00AK,small_airport,Lowell Field,450.0,NaN,US,US-AK,Anchor Point,00AK,NaN,00AK,"-151.695999146, 59.94919968"
3,00AL,small_airport,Epps Airpark,820.0,NaN,US,US-AL,Harvest,00AL,NaN,00AL,"-86.77030181884766, 34.86479949951172"
4,00AR,closed,Newport Hospital & Clinic Heliport,237.0,NaN,US,US-AR,Newport,NaN,NaN,NaN,"-91.254898, 35.6087"

In [19]:
# Get port locations from SAS text file
with open("./I94_SAS_Labels_Descriptions.SAS") as f:
    content = f.readlines()
content = [x.strip() for x in content]
ports = content[302:962]
splitted_ports = [port.split("=") for port in ports]
port_codes = [x[0].replace("'","").strip() for x in splitted_ports]
port_locations = [x[1].replace("'","").strip() for x in splitted_ports]
port_cities = [x.split(",")[0] for x in port_locations]
port_states = [x.split(",")[-1] for x in port_locations]
df_port_locations = pd.DataFrame({"port_code" : port_codes, "port_city": port_cities, "port_state": port_states})
df_port_locations.head(5)

  port_code                 port_city port_state
0       ALC                     ALCAN         AK
1       ANC                 ANCHORAGE         AK
2       BAR  BAKER AAF - BAKER ISLAND         AK
3       DAC             DALTONS CACHE         AK
4       PIZ    DEW STATION PT LAY DEW         AK

In [20]:
# print first and last element in dict to check if all lines in file are covered and they are matching with the file
print(f"First port in data frame {df_port_locations['port_city'].values[0]}, last port {df_port_locations['port_city'].values[-1]}")

First port in data frame ALCAN, last port No PORT Code (OSN)

### Step 2: Explore and Assess the Data
#### Explore the Data 
Identify data quality issues, like missing values, duplicate data, etc.

In [11]:
df_i94.describe()

,cicid,i94yr,i94mon,i94cit,i94res,arrdate,i94mode,depdate,i94bir,i94visa,count,biryear,admnum
count,3.096313e+06,3096313.0,3096313.0,3.096313e+06,3.096313e+06,3.096313e+06,3.096074e+06,2.953856e+06,3.095511e+06,3.096313e+06,3096313.0,3.095511e+06,3.096313e+06
mean,3.078652e+06,2016.0,4.0,3.049069e+02,3.032838e+02,2.055985e+04,1.073690e+00,2.057395e+04,4.176761e+01,1.845393e+00,1.0,1.974232e+03,7.082885e+10
std,1.763278e+06,0.0,0.0,2.100269e+02,2.085832e+02,8.777339e+00,5.158963e-01,2.935697e+01,1.742026e+01,3.983910e-01,0.0,1.742026e+01,2.215442e+10
min,6.000000e+00,2016.0,4.0,1.010000e+02,1.010000e+02,2.054500e+04,1.000000e+00,1.517600e+04,-3.000000e+00,1.000000e+00,1.0,1.902000e+03,0.000000e+00
25%,1.577790e+06,2016.0,4.0,1.350000e+02,1.310000e+02,2.055200e+04,1.000000e+00,2.056100e+04,3.000000e+01,2.000000e+00,1.0,1.962000e+03,5.603523e+10
50%,3.103507e+06,2016.0,4.0,2.130000e+02,2.130000e+02,2.056000e+04,1.000000e+00,2.057000e+04,4.100000e+01,2.000000e+00,1.0,1.975000e+03,5.936094e+10
75%,4.654341e+06,2016.0,4.0,5.120000e+02,5.040000e+02,2.056700e+04,1.000000e+00,2.057900e+04,5.400000e+01,2.000000e+00,1.0,1.986000e+03,9.350987e+10
max,6.102785e+06,2016.0,4.0,9.990000e+02,7.600000e+02,2.057400e+04,9.000000e+00,4.542700e+04,1.140000e+02,3.000000e+00,1.0,2.019000e+03,9.991557e+10

In [12]:
#df_i94.isnull().values.any()
df_i94.isnull().sum().sum()

12139654

In [13]:
df_temp_us.describe()

       AverageTemperature  AverageTemperatureUncertainty
count       661524.000000                   661524.00000
mean            13.949335                        1.08955
std              9.173337                        1.15068
min            -25.163000                        0.04000
25%              7.787000                        0.30000
50%             14.922000                        0.52400
75%             21.081000                        1.64600
max             34.379000                       10.51900

In [14]:
df_temp_us.isnull().sum().sum()

51530

In [15]:
df_airport_codes.describe()

       elevation_ft
count  48069.000000
mean    1240.789677
std     1602.363459
min    -1266.000000
25%      205.000000
50%      718.000000
75%     1497.000000
max    22000.000000

In [16]:
df_airport_codes.isnull().sum().sum()

126968

#### Data transformation/Cleaning Steps

Document steps necessary to clean the data<br>
1- Removing '\x00' from i94 dataset.<br>
2- Identifying irregular port details, and removing them from i94 dataset.<br>
3- Removing NA values from datasets.<br>
4- Converting string values (arrdate & depdate) to date in i94 data<br>
5- Along with the immigration , temperature, airport and demographics data for analytical querying creating date dataset for summarizing data at year/quarter/month level.<br>
6- Joining airpot and port dataframes, remove duplicate entries . After anlyzing the data , found that duplicates are due to airport type 'closed'.<br>

In [18]:
#This is to remove NUL characters.
re_null = re.compile(pattern='\x00')
df_i94.replace(regex=re_null,value=' ', inplace=True)

In [21]:
#There are some ports with no city and state information, need to identify them.
irregular_ports_df = df_port_locations[df_port_locations["port_city"] == df_port_locations["port_state"]]
irregular_ports = list(set(irregular_ports_df["port_code"].values))
print(irregular_ports)

['OGS', 'JFA', 'MAP', 'CXO', 'PHN', 'GPI', 'OSN', 'WAS', 'LIT', 'JBQ', 'GMT', 'PHF', 'AUH', 'BCM', 'VMB', 'EGE', 'STN', 'HRL', 'OTS', 'PCW', 'WTR', 'WA5', 'A2A', 'RYY', 'AKT', 'FRG', '5T6', 'TIW', 'FSC', 'ZZZ', 'X44', 'CPX', 'ADU', 'IAG', 'BUS', 'DAY', 'MAA', 'AMT', 'W55', '888', 'ATW', 'DEC', 'JIG', 'OLM', 'SUS', 'NC8', 'UNK', 'FTB', 'SP0', 'DRV', 'T01', 'GAC', 'JMZ', 'CLX', 'BKF', '.GA', 'JSJ', 'AG', 'XXX', 'PFN', 'XNA', 'MTH', 'ASI', 'CP', 'X96', 'NK', 'NYL', 'OAI', '060', 'ISP', '74S', 'YGF', 'Y62', 'SCH', 'CHN', 'PLB', 'NGL']

In [22]:
# drop all irregular ports from i94 data
print(f"i94 data contains {len(df_i94)} rows before removing irregular ports.")
df_i94_filtered = df_i94[~df_i94["i94port"].isin(irregular_ports)]
print(f"i94 data contains {len(df_i94_filtered)} rows after removing irregular ports.")
df_i94_filtered.drop(columns=["insnum", "entdepu", "occup", "visapost"], inplace=True)
df_i94_filtered.dropna(inplace=True)
print(f"i94 data contains {len(df_i94_filtered)} rows after removing NaN values.")

print('Removing Nul characters from the data')
re_null = re.compile(pattern='\x00')
df_i94_filtered.replace(regex=re_null,value=' ', inplace=True)

i94 data contains 3096313 rows before removing irregular ports.
i94 data contains 2995590 rows after removing irregular ports.

/opt/conda/lib/python3.6/site-packages/pandas/core/frame.py:3697: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  errors=errors)
/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

i94 data contains 2306754 rows after removing NaN values.
Removing Nul characters from the data

/opt/conda/lib/python3.6/site-packages/pandas/core/frame.py:3798: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  method=method)

In [23]:
#Converting arrdate and depdate to date format.
df_i94_filtered['arrdate'] = pd.TimedeltaIndex(df_i94_filtered['arrdate'], unit='d') + dt.datetime(1899, 12, 30)
df_i94_filtered['depdate'] = pd.TimedeltaIndex(df_i94_filtered['depdate'], unit='d') + dt.datetime(1899, 12, 30)

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [24]:
df_i94_filtered.head(5)

,cicid,i94yr,i94mon,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,i94bir,i94visa,count,dtadfile,entdepa,entdepd,matflag,biryear,dtaddto,gender,airline,admnum,fltno,visatype
12,27.0,2016.0,4.0,101.0,101.0,BOS,1956-03-31,1.0,MA,1956-04-04,58.0,1.0,1.0,20160401,G,O,M,1958.0,04062016,M,LH,9.247876e+10,00422,B1
13,28.0,2016.0,4.0,101.0,101.0,ATL,1956-03-31,1.0,MA,1956-04-04,56.0,1.0,1.0,20160401,G,O,M,1960.0,04062016,F,LH,9.247890e+10,00422,B1
14,29.0,2016.0,4.0,101.0,101.0,ATL,1956-03-31,1.0,MA,1956-04-16,62.0,2.0,1.0,20160401,G,O,M,1954.0,09302016,M,AZ,9.250378e+10,00614,B2
15,30.0,2016.0,4.0,101.0,101.0,ATL,1956-03-31,1.0,NJ,1956-05-03,49.0,2.0,1.0,20160401,G,O,M,1967.0,09302016,M,OS,9.247021e+10,00089,B2
16,31.0,2016.0,4.0,101.0,101.0,ATL,1956-03-31,1.0,NY,1956-06-05,43.0,2.0,1.0,20160401,G,O,M,1973.0,09302016,M,OS,9.247129e+10,00089,B2

In [25]:
# clear missing temperature values
print('DataFrame before drop na count of data frame df_temp_us-'+str(len(df_temp_us)))
df_temp_us.dropna(inplace=True)
print('DataFrame after drop na count of data frame df_temp_us-'+str(len(df_temp_us)))

DataFrame before drop na count of data frame df_temp_us-687289
DataFrame after drop na count of data frame df_temp_us-661524

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [26]:
#Creating a date table using data from temperature dataframe
dt_ser=df_temp_us['dt']#1820-01-01
df_time = pd.DataFrame(dt_ser)
df_time['Year'] = pd.DatetimeIndex(df_time['dt']).year
df_time['Month'] = pd.DatetimeIndex(df_time['dt']).month
df_time['Quarter'] = pd.DatetimeIndex(df_time['dt']).quarter

#Validated if quarter derived is correct or not
print(df_time[df_time['Quarter']==4]['Month'].unique())
print(df_time[df_time['Quarter']==3]['Month'].unique())
print(df_time[df_time['Quarter']==2]['Month'].unique())
print(df_time[df_time['Quarter']==1]['Month'].unique())
df_time.head(5)

[10 11 12]
[7 8 9]
[4 5 6]
[1 2 3]

               dt  Year  Month  Quarter
47555  1820-01-01  1820      1        1
47556  1820-02-01  1820      2        1
47557  1820-03-01  1820      3        1
47558  1820-04-01  1820      4        2
47559  1820-05-01  1820      5        2

In [27]:
print('DataFrame before drop na count of data frame df_airport_codes-'+str(len(df_airport_codes)))
df_airport_codes.dropna(subset=['iata_code'], inplace=True)
print('DataFrame after drop na count of data frame df_airport_codes-'+str(len(df_airport_codes)))

DataFrame before drop na count of data frame df_airport_codes-55075
DataFrame after drop na count of data frame df_airport_codes-9189

In [28]:
df_airport_codes.head(5)

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
223,03N,small_airport,Utirik Airport,4.0,OC,MH,MH-UTI,Utirik Island,K03N,UTK,03N,"169.852005, 11.222"
440,07FA,small_airport,Ocean Reef Club Airport,8.0,NaN,US,US-FL,Key Largo,07FA,OCA,07FA,"-80.274803161621, 25.325399398804"
594,0AK,small_airport,Pilot Station Airport,305.0,NaN,US,US-AK,Pilot Station,NaN,PQS,0AK,"-162.899994, 61.934601"
673,0CO2,small_airport,Crested Butte Airpark,8980.0,NaN,US,US-CO,Crested Butte,0CO2,CSE,0CO2,"-106.928341, 38.851918"
1088,0TE7,small_airport,LBJ Ranch Airport,1515.0,NaN,US,US-TX,Johnson City,0TE7,JCY,0TE7,"-98.62249755859999, 30.251800537100003"

In [31]:
df_airport_codes = df_airport_codes.merge(df_port_locations, left_on="iata_code", right_on="port_code")
df_airport_codes.head()
df_airport_codes.drop(columns=["port_code"], inplace=True)
df_airport_codes = df_airport_codes[["iata_code", "name", "type", "local_code", "coordinates", "port_city", "elevation_ft", "continent", "iso_country", "iso_region", "municipality", "gps_code"]]
df_airport_codes.head(5)

,iata_code,name,type,local_code,coordinates,port_city,elevation_ft,continent,iso_country,iso_region,municipality,gps_code
0,TKI,Tokeen Seaplane Base,seaplane_base,57A,"-133.32699585, 55.9370994568",TOKEEN,NaN,NaN,US,US-AK,Tokeen,57A
1,BKF,Lake Brooks Seaplane Base,seaplane_base,5Z9,"-155.77699279785, 58.554798126221",No PORT Code (BKF),36.0,NaN,US,US-AK,Katmai National Park,5Z9
2,AXB,Maxson Airfield,small_airport,89NY,"-75.90034, 44.312002",ALEXANDRIA BAY,340.0,NaN,US,US-NY,Alexandria Bay,89NY
3,FRE,Fera/Maringe Airport,small_airport,NaN,"159.576996, -8.1075",FRESNO,NaN,OC,SB,SB-IS,Fera Island,AGGF
4,ANZ,Angus Downs Airport,small_airport,NaN,"132.2748, -25.0325",ANZALDUAS,1724.0,OC,AU,AU-NT,Angus Downs Station,NaN

In [33]:
df_airport_codes[df_airport_codes.duplicated(['iata_code'], keep=False)]

,iata_code,name,type,local_code,coordinates,port_city,elevation_ft,continent,iso_country,iso_region,municipality,gps_code
5,BCK,[Duplicate] Bolwarra Airport,closed,NaN,"144.169006348, -17.388299942",BUCKPORT,NaN,OC,AU,AU-QLD,Bolwarra,NaN
6,BCK,Bolwarra Airport,small_airport,NaN,"144.169006348, -17.388299942",BUCKPORT,NaN,OC,AU,AU-QLD,NaN,YBWR
9,HIG,[Duplicate] Highbury Airport,closed,NaN,"143.145996094, -16.4244003296",HIGHGATE SPRINGS,NaN,OC,AU,AU-QLD,Highbury,NaN
10,HIG,Highbury Airport,small_airport,NaN,"143.145996094, -16.4244003296",HIGHGATE SPRINGS,NaN,OC,AU,AU-QLD,NaN,YHHY
11,MNW,[Duplicate] Macdonald Downs Airport,closed,NaN,"135.199005127, -22.444000244099996",MANITOWOC,NaN,OC,AU,AU-NT,Macdonald Downs,NaN
12,MNW,Macdonald Downs Airport,small_airport,NaN,"135.199005127, -22.444000244099996",MANITOWOC,NaN,OC,AU,AU-NT,NaN,YMDS
14,AUS,Austin Robert Mueller Municipal,closed,NaN,"-97.6997852325, 30.2987223546",AUSTIN,NaN,NaN,US,US-TX,NaN,KAUS
15,AUS,Austin Bergstrom International Airport,large_airport,AUS,"-97.6698989868164, 30.194499969482422",AUSTIN,542.0,NaN,US,US-TX,Austin,KAUS
27,CLG,Coalinga Airport,closed,NaN,"-120.360116959, 36.1580433385",CALGARY,NaN,NaN,US,US-CA,NaN,NaN
28,CLG,New Coalinga Municipal Airport,small_airport,C80,"-120.29399871826172, 36.16310119628906",CALGARY,622.0,NaN,US,US-CA,Coalinga,NaN
34,DLR,Dalnerechensk Airport,small_airport,NaN,"133.7363, 45.8783",DEL RIO,272.0,EU,RU,RU-PRI,Dalnerechensk,UHHD
35,DLR,Dalnerechensk Airport,small_airport,NaN,"133.7363, 45.8783",DEL RIO,272.0,EU,RU,RU-PRI,Dalnerechensk,NaN
483,VQS,Vieques Airport,closed,NaN,"-65.4226989746, 18.115800857500002",VIEQUES-ARPT,19.0,NaN,PR,PR-U-A,Vieques Island,TJCG
484,VQS,Antonio Rivera Rodriguez Airport,small_airport,VQS,"-65.493598938, 18.1347999573",VIEQUES-ARPT,49.0,NaN,PR,PR-U-A,Vieques Island,TJVQ

In [34]:
#I took the index manually by using above query and deleted them
indexes = [5,9,11,14,27,483,34]
df_airport_codes.drop(indexes,inplace=True)

### Step 3: Define the Data Model
#### 3.1 Conceptual Data Model
Map out the conceptual data model and explain why you chose that model, this will help in analyzing the data using dates and port data.

![title](Data_Model.PNG)

#### 3.2 Mapping Out Data Pipelines
List the steps necessary to pipeline the data into the chosen data model

There are multiple ways to load the data, 1- creating a wid/key in the dimension table and populate a sequence number, when loading the fact table using natural key do look up and populate respective dim keys in the fact table.Load dimensions and fact table in order and other one <br> 2- use natural keys across, and can be loaded independently, for running queries join using natural keys. I preferred second approach. <br><br>

Step1 - Create tables by executing create_tables.py, this will create the database and tables required. <br>
Step2 - Establish connection to the database <br>
Step3 - Insert data into tables. <br>
Step4 - Validate the data in tables<br>
Step5 - Close the database connection.

### Step 4: Run Pipelines to Model the Data 
#### 4.1 Create the data model
Build the data pipelines to create the data model.

In [36]:
# After running create_tables.py, insert the data into the database
conn = psycopg2.connect("host=127.0.0.1 dbname=sparkifydb user=student password=student")
cur = conn.cursor()

In [37]:
for index, row in df_airport_codes.iterrows():
    cur.execute(airport_insert, list(row.values))
    conn.commit()

In [38]:
for index, row in df_demographics.iterrows():
    cur.execute(demographic_insert, list(row.values))
    conn.commit()

In [39]:
for index, row in df_time.iterrows():
    cur.execute(dates_insert, list(row.values))
    conn.commit()

In [43]:
for index, row in df_port_locations.iterrows():
    cur.execute(ports_insert, list(row.values))
    conn.commit()

In [42]:
for index, row in df_i94_filtered.iterrows():
    cur.execute(immigration_insert, list(row.values))
    conn.commit()

In [44]:
for index, row in df_temp_us.iterrows():
    cur.execute(temperature_insert, list(row.values))
    conn.commit()

#### 4.2 Data Quality Checks
Explain the data quality checks you'll perform to ensure the pipeline ran as expected. These could include:
 * Integrity constraints on the relational database (e.g., unique key, data type, etc.)
 * Unit tests for the scripts to ensure they are doing the right thing
 * Source/Count checks to ensure completeness
 
Run Quality Checks

In [45]:
print('df_i94_filtered rec cnt '+str(len(df_i94_filtered)))

df_i94_filtered rec cnt 2306754

In [46]:
%load_ext sql

In [47]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [ ]:
## Verifying data in the tables

In [50]:
%sql select 'airports' as tbl, count(*) from airports union all select 'temperature' as tbl, count(*) from temperature union select 'demographics' as tbl, count(*) from demographics union select 'immigration' as tbl, count(*) from immigrations union  select 'dates' as tbl, count(*) from dates union  select 'port' as tbl, count(*) from ports

 * postgresql://student:***@127.0.0.1/sparkifydb
6 rows affected.

[('demographics', 2891),
 ('temperature', 661524),
 ('port', 660),
 ('immigration', 2306754),
 ('airports', 550),
 ('dates', 661524)]

In [53]:
## I ran some checks to verify for duplicates and there are no duplicates, also i ran some analytical queries.

In [1]:
%sql select visatype,count(*) from immigrations group by visatype  order by count(*) desc limit 5

UsageError: Line magic function `%sql` not found.

#### Below query used to analyze to which cities people migrated more, i got the result by joining ports and immigrations tables and displaed only 10 records. Similarly, I ran some queries to identify immration patterns by joining with temperatures, by joining with demographics i found some results to understand the data patterns. Below query i used to show case one such use case.

In [52]:
%sql select iata, port_city, port_state,count(*) from immigrations i join ports p on p.port_code=i.iata  group by iata, port_city, port_state order by count(*) desc limit 10

 * postgresql://student:***@127.0.0.1/sparkifydb
10 rows affected.

[('NYC', 'NEW YORK', ' NY', 374318),
 ('MIA', 'MIAMI', ' FL', 277355),
 ('LOS', 'LOS ANGELES', ' CA', 238204),
 ('SFR', 'SAN FRANCISCO', ' CA', 131580),
 ('NEW', 'NEWARK/TETERBORO', ' NJ', 127034),
 ('ORL', 'ORLANDO', ' FL', 116442),
 ('HHW', 'HONOLULU', ' HI', 110571),
 ('CHI', 'CHICAGO', ' IL', 98292),
 ('HOU', 'HOUSTON', ' TX', 83856),
 ('FTL', 'FORT LAUDERDALE', ' FL', 76490)]

#### Step 5: Complete Project Write Up
* Clearly state the rationale for the choice of tools and technologies for the project.<br>
  For the purpose this project I used, python as this gives more flexibility to read data from various formats, connect to postgres database and apply transformations and used postgres as target database .
* Propose how often the data should be updated and why. <br>
  It should be loaded on monthly basis, in my opinion data gets accumulated and analytics can be performed on huge volumes of data.
* Write a description of how you would approach the problem differently under the following scenarios:
 * The data was increased by 100x.<br>
     Need to use Cloud services like AWS EMR to use spark for processing data. For current project, i didn't use redshift. But we can use redshift for storage purposes . Redshift will auto scale based on data load, good for running analytical queries to process large volumes of data, being on cloud will help to auto scale. While desiging tables in redshift, for each table sort key and distribution key need to be identified to optimize the performance.
 * The data populates a dashboard that must be updated on a daily basis by 7am every day.<br>
 We can use Apache Airflow for building ETL pipelines, airflow enables automation from end to end. We can create controls in airflow to read/write to S3, invoking processing, read/write to redshift. 
 * The database needed to be accessed by 100+ people.<br>
 AWS redshift can handle multiple connections, using IAM roles we can restrict the relevant resources on cloud. RedShift features (sort key & dist key) helps in storing data in a way that it can be efficiently be accessed by many people.

In [54]:
conn.close()